#+LaTeX_HEADER: \usepackage[margin=1in]{geometry}
#+LATEX_HEADER: \usepackage{comment,tikz}
#+OPTIONS: toc:nil
#+TITLE: An exact solution for the enthalpy equation (simplified setup)
#+BEGIN_LaTeX
  \newcommand{\diff}[2]{\frac{\partial #1}{\partial #2}}
#+END_LaTeX
#+BEGIN_SRC elisp :exports none
(org-babel-tangle)
#+END_SRC

* Checking the units

  #+NAME: check_units
  #+BEGIN_SRC maxima :exports results :tangle enthalpy_units.mac :results output latex :cache yes
    load(ezunits);

    /* unit simplifications */
    J : W * s;
    Pascal : kg / (meter * second**2);

    declare_units(c, J / (kg * Kelvin)); /* specific heat capacity */
    declare_units(k, W / (meter * Kelvin)); /* thermal conductivity */

    declare_units(G, W / meter**2); /* basal heat flux */
    declare_units(H, W * s / kg); /* enthalpy */
    declare_units(dz, meter); /* grid spacing */

    declare_units(T0, Kelvin); /* reference temperature */
    declare_units(T_melting, Kelvin); /* melting temperature */

    declare_units(b, Kelvin / Pascal); /* Clausius-Clapeyron beta */

    declare_units(g, meter / second**2); /* standard gravity */
    declare_units(rho, kg / meter**3);

    /* enthalpy diffusivity: */
    declare_units(K, units(k) / units(c));

    /* check the units of the Neumann B.C.: */
    NBC : units(G) - units((H / dz) * K);

    /* check the units of the depth of the cold layer: */
    Dc : (c*K*T0 + (H[3] - c*T_melting)*K) / (b * c * g * rho * K - G);

    tex_qty(e) := tex1(args(e)[1]);
    texput(nounify(qty), tex_qty);
    texput(T_melting, "T_{\\text{melting}}");

    tex(D[c] = Dc);
  #+END_SRC

  #+RESULTS[c72cf76f71449e216379a56a0eab59c77df59f71]: check_units
  #+BEGIN_LaTeX
  $$D_{c}={{c\,K\,{\it T_0}+\left(H_{3}-c\,T_{\text{melting}}\right)\,K
   }\over{b\,c\,g\,\rho\,K+G}}\;\mathrm{meter}$$
  #+END_LaTeX
